# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

N = int(input("Введите количество кустов: "))
berries = [int(input("Введите урожайность куста: ")) for _ in range(N)]

max_berries = 0

for i in range(N):
    curr_berries = berries[i] + berries[(i+1) % N] + berries[(i-1) % N]
    if curr_berries > max_berries:
        max_berries = curr_berries

print("Максимальное количество ягод:", max_berries)
